Revit 2024 API
IFCExportOptions Constructor
 Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public IFCExportOptions()
Visual Basic
Public Sub New
Visual C++
public:
IFCExportOptions()
See Also
IFCExportOptions Class
IFCExportOptions Overload
Autodesk.Revit.DB Namespace